"""Снабди каждый комментарий правильной командой."""


                          python3 -V # команда для проверки текущей версии Питона
                             python3 # запуск интерпретатора Питона в режиме REPL
    python3 -m venv name_environment # создание виртуального окружения в текущей директории
source name_environment/bin/activate # активация вышесозданного виртуального окружения
                          deactivate # деактивация виртуального окружения
                      python3 run.py # запуск скрипта run.py находящегося в текущей директории
                pip install requests # установка пакета requests через пакетный менеджер pip
